USE	MusicStore
GO

--************************************************************************************************************************
/*Збережена процедура показує повну інформацію про му-
зичні диски  */
------------------------Створення процедури---------------------------
CREATE PROCEDURE GetInfo_MusicalDisc
AS
	SELECT [D].[Name] AS 'Назва диску',
			[A].[Name] AS 'Виконавець',
			[S].[Name] AS 'Стиль диску',
			[D].[DatePublish] AS 'Дата виходу',
			[P].[Name] AS 'Видавець'
	FROM [Disc] D, [Artist] A, [Style] S, [Publisher] P
	WHERE [D].[IdArtist] = [A].[Id] AND
			[D].[IdStyle] = [S].[Id] AND
			[D].[IdPublisher] = [P].[Id]
GO
---------------------Кінець створень процедури-------------------------
-------------------------Тестування процедури--------------------------
exec GetInfo_MusicalDisc;
--************************************************************************************************************************
/*Збережена процедура показує повну інформацію про всі
музичні диски конкретного видавця. Назва видавця пере-
дається як параметр*/
------------------------Створення процедури---------------------------
GO
CREATE PROCEDURE GetInfo_MusicalDisc_FromPublisher
@Pub nvarchar(100)
AS
	SELECT [D].[Name] AS 'Назва диску',
				[A].[Name] AS 'Виконавець',
				[S].[Name] AS 'Стиль диску',
				[D].[DatePublish] AS 'Дата виходу',
				[P].[Name] AS 'Видавець'
		FROM [Disc] D, [Artist] A, [Style] S, [Publisher] P
		WHERE [D].[IdArtist] = [A].[Id] AND
				[D].[IdStyle] = [S].[Id] AND
				[D].[IdPublisher] = [P].[Id] AND
				[P].[Name] = @Pub
GO
---------------------Кінець створень процедури-------------------------
-------------------------Тестування процедури--------------------------
GetInfo_MusicalDisc_FromPublisher 'Parlophone'
--************************************************************************************************************************
/*Збережена процедура показує назву найпопулярнішо-
го стилю. Популярність стилю визначається за кількістю
дисків у колекції*/
------------------------Створення процедури---------------------------



---------------------Кінець створень процедури-------------------------

-------------------------Тестування процедури--------------------------

--************************************************************************************************************************
/*Збережена процедура відображає інформацію про диск
конкретного стилю з найбільшою кількістю пісень. 
Назва стилю передається як параметр, якщо передано слово all,
аналіз йде за всіма стилями*/
------------------------Створення процедури---------------------------



---------------------Кінець створень процедури-------------------------

-------------------------Тестування процедури--------------------------

--************************************************************************************************************************
/*Збережена процедура видаляє всі диски заданого стилю.
Назва стилю передається як параметр. Процедура повер-
тає кількість видалених альбомів*/
------------------------Створення процедури---------------------------



---------------------Кінець створень процедури-------------------------

-------------------------Тестування процедури--------------------------

--************************************************************************************************************************
/*Збережена процедура відображає інформацію про самий
«старий» альбом і самий «молодий». Старість та молодість
визначаються за датою випуску;*/
------------------------Створення процедури---------------------------



---------------------Кінець створень процедури-------------------------

-------------------------Тестування процедури--------------------------

--************************************************************************************************************************
/*Збережена процедура видаляє всі диски в назві яких є за-
дане слово. Слово передається як параметр. Процедура
повертає кількість видалених альбомів.*/
------------------------Створення процедури---------------------------



---------------------Кінець створень процедури-------------------------

-------------------------Тестування процедури--------------------------

